Комплексная_автоматизация_2_МОМ_2019/src/Enums/ОперацииЗакрытияМесяца/ОперацииЗакрытияМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииЗакрытияМесяца</name>
  <enumValues>
    <name>АннулированиеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеДублейВидовЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокВИсходныхДанных</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииНМА</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОС</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОСиНМАМеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>НачислениеОценочныхОбязательствРезервовПоОтпускам</name>
  </enumValues>
  <enumValues>
    <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВРегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеЗарплатыВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыкупаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыработкиСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковТоваровКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовКомитентамОСписании</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПроизводстваБезЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСчетовФактурИТаможенныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаДвиженийПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаДенежныхСредствИФинансовыхИнструментов</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаНовыеРежимыУчета</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетВнеоборотныхАктивовВерсии24</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПроизводстваПродукцииБезСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНалоговомУчетеЛизинговыхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеДоходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеНДС</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВВалютеПредставления</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВФункциональнойВалюте</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетПартийИСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>РасчетСтоимостиВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатратНаВыпускБезРаспоряжений</name>
  </enumValues>
  <enumValues>
    <name>СторноДоходовКУДиР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАмортизацияОС</name>
    <comment>Использовалось до версии 2.4</comment>
  </enumValues>
  <enumValues>
    <name>УстановкаДатыЗапретаФормированияПроводокМУ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоВнеоборотнымАктивам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеДокументовРаспределенияРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСводныхСправокНДС</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ОперацииЗакрытияМесяца/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ДляЗаданийКЗакрытиюМесяца") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// В форме списка регистра заданий к закрытию месяца для выбора доступны только те значения перечисления,
	// которые поддерживаются в механизме закрытия месяца.
	// см. использование функции ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца().
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствИФинансовыхИнструментов);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС);
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов);
	КонецЕсли;
	//++ НЕ УТ
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеЛизинговыхПлатежей);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПогашениеСтоимостиТМЦВЭксплуатации);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеРасходовПоНаправлениямДеятельности);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеДоходовПоНаправлениямДеятельности);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.СторноДоходовКУДиР);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПриУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата);
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти
